Revit 2026 API

# RebarCrankTypeUtilsGetCrankRatio Method

---

Gets the crank ratio value.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static double GetCrankRatio(
	Document document,
	ElementId rebarCrankTypeId
)
```
```vb
Public Shared Function GetCrankRatio (
	document As Document,
	rebarCrankTypeId As ElementId
) As Double
```
```cpp
public:
static double GetCrankRatio(
	Document^ document,
	ElementId^ rebarCrankTypeId
)
```
```fsharp
static member GetCrankRatio :
        document : Document *
        rebarCrankTypeId : ElementId -> float
```

#### Parameters

document Document
     The document.
rebarCrankTypeId ElementId
     The Rebar Crank Type id.

#### Return Value

Double Returns the crank ratio value.

| Exception | Condition |
| --- | --- |
| ArgumentException | The rebarCrankTypeId doesn't represent a valid Rebar Crank Type. It should be an ElementType of BuiltInCategory.OST_RebarCrankType category. |
| ArgumentNullException | A non-optional argument was null |

The crank slope is 1/crankRatio.

#### Reference

RebarCrankTypeUtils Class

Autodesk.Revit.DB.Structure Namespace